app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        comment = Comment.find(params[:id])

INSERT INTO "comments" ("content", "user_id", "grocery_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "are you working...?"], ["user_id", 1], ["grocery_id", 3], ["created_at", "2022-10-05 14:44:09.756333"], ["updated_at", "2022-10-05 14:44:09.756333"]]
---
    def create
        comment = Comment.create!(comment_params)