app/controllers/groceries_controller.rb

    def set_grocery
      grocery = Grocery.find(params[:id])
---
SELECT "groceries".* FROM "groceries" WHERE "groceries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]