app/controllers/groceries_controller.rb

SELECT "groceries".* FROM "groceries"
---
  def index
    groceries = Grocery.all

SELECT "groceries".* FROM "groceries" WHERE "groceries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    grocery = Grocery.find(params[:id])

INSERT INTO "groceries" ("name", "price", "quantity", "store", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Toothpaste"], ["price", 20], ["quantity", "3 ea."], ["store", "Giant"], ["date", "2022-09-23"], ["created_at", "2022-09-24 02:08:04.979606"], ["updated_at", "2022-09-24 02:08:04.979606"]]
---
  def create
      grocery = Grocery.create!(grocery_params)

SELECT "groceries".* FROM "groceries" WHERE "groceries"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "groceries" SET "quantity" = ?, "store" = ?, "updated_at" = ? WHERE "groceries"."id" = ?  [["quantity", "Oabcdefghijklmnopqrstuvwxyz"], ["store", "Oabcdefghijklmnopqrstuvwxyz"], ["updated_at", "2022-10-05 21:18:21.321274"], ["id", 21]]
---
  def update
    grocery = Grocery.find(params[:id])
    grocery.update!(grocery_params)

SELECT "groceries".* FROM "groceries" WHERE "groceries"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "groceries" WHERE "groceries"."id" = ?  [["id", 4]]
---
  def destroy
    grocery = Grocery.find(params[:id])
    grocery.destroy

SELECT "groceries".* FROM "groceries"
---
  def groceries_images
    groceries = Grocery.all
    groceries_mapped = groceries.map{|grocery| GrocerySerializer.new(grocery).serializable_hash[:data][:attributes]}

SELECT "groceries".* FROM "groceries" WHERE "groceries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def grocery_image
    grocery = Grocery.find(params[:id])