app/controllers/grocery_comments_controller.rb

    def show
        render json: Comment.where(grocery_id: params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."grocery_id" = ?  [["grocery_id", 3]]