app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "username4"], ["password_digest", "[FILTERED]"], ["created_at", "2022-09-22 01:29:57.758953"], ["updated_at", "2022-09-22 01:29:57.758953"]]
---
    def create
        user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def get_logged_in
        user = User.find(session[:user_id])